DataProcessors/Лео_АктОКК/Лео_АктОКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_АктОКК</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтвественныйОКК</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТоваров</name>
  <comment>(Общ)</comment>
  <basedOn>Document.ИнвентаризацияТоваровНаСкладе</basedOn>
  <basedOn>Document.ПередачаТоваров</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.КорректировкаРеализации</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.Лео_ЗаявкаНаОбразцы</basedOn>
  <basedOn>Document.ВозвратТоваровОтПокупателя</basedOn>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПередачеСоСкладов</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.НДСНачисленный</registerRecords>
  <registerRecords>InformationRegister.РасшифровкаКУДиР</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРознице</registerRecords>
  <registerRecords>AccumulationRegister.НДСПартииТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНТТ</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПередачеОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ДокументыТребующиеДопроведения</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатратРегл</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВнутренниеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.НДСВключенныйВСтоимость</registerRecords>
  <registerRecords>InformationRegister.СписанныеТовары</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.НДСпоОСиНМА</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.РеализованныеТовары</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВРезервеНаСкладах</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВНалоговомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <comment>(Общ) Основание (статья) списания</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентаризацияТоваровНаСкладе</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ИнвентаризацияТоваровНаСкладе</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСвСтоимостиТоваров</name>
    <comment>Необходимые действия по включению или исключению НДС в тоимости товаров при перемещении</comment>
    <type>
      <types>EnumRef.ДействиеНДСВСтоимостиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.абс_ХозяйственныеОперацииПУБ77</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДокументОснование</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаОбразцы</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ВнутреннийЗаказ</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.КорректировкаРеализации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗаявкаНаРасходованиеСредств</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ПричинаСписания</name>
    <type>
      <types>CatalogRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Подписант1</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Подписант2</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Подписант3</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Подписант4</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускРазрешил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_оборудование</name>
    <type>
      <types>CatalogRef.Лео_оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <type>
      <types>CatalogRef.ГосударственныеКонтракты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наладчик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_количествоПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>DocumentRef.ПередачаТоваров</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ВнутреннийЗаказ</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПринятыеСчетУчетаБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтражениеВУСН</name>
      <type>
        <types>EnumRef.ОтражениеВУСН</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратнаяТара</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ПередачаТоваров</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ВнутреннийЗаказ</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DataProcessors/Лео_АктОКК/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СформироватьАкт(Команда)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ОтображатьСетку = ложь;
	Макет = Обработки.Лео_АктОКК.ПолучитьМакет("АктОКК");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст ="ВЫБРАТЬ ПЕРВЫЕ 1
	                   |	МАКСИМУМ(СписаниеТоваров.Номер) КАК НомерДок
	                   |ИЗ
	                   |	Документ.СписаниеТоваров КАК СписаниеТоваров
	                   |ГДЕ
	                   |	СписаниеТоваров.абс_ХозяйственнаяОперация = &ХозОперация
	                   |	И СписаниеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                   |	И СписаниеТоваров.Проведен = ИСТИНА
	                   |
	                   |УПОРЯДОЧИТЬ ПО
	                   |	НомерДок";
				  
	ЗапросШапка.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.НачалоПериода));
	ЗапросШапка.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	ЗапросШапка.УстановитьПараметр("ХозОперация", Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000023"));
	
	Шапка = ЗапросШапка.Выполнить().Выбрать();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТЧ");
	ОбластьСтрокаТабЧасти = Макет.ПолучитьОбласть("СтрокаТЧ");
	
	Если Шапка.Следующий() Тогда		
	
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Шапка);
		ОбластьШапка.Параметры.ДатаИзъятия  = Формат(Объект.КонецПериода, "ДФ=dd.MM.yyyy"); 
		ОбластьШапка.Параметры.ПериодОтбора = "с " + Формат(Объект.НачалоПериода, "ДЛФ=DD") + "по " + Формат(Объект.КонецПериода, "ДЛФ=DD");
		ТабДокумент.Вывести(ОбластьШапка);                      		
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	
	КонецЕсли;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеТоваровТовары.Номенклатура.Наименование КАК Номенклатура,
	               |	СписаниеТоваровТовары.СерияНоменклатуры.Наименование КАК Серия,
	               |	СписаниеТоваровТовары.ЕдиницаИзмерения.Наименование КАК ЕдИзм,
	               |	СписаниеТоваровТовары.Количество КАК Количество,
	               |	СписаниеТоваровТовары.Ссылка.Склад.Наименование КАК МестоИзъятия,
	               |	СписаниеТоваровТовары.Ссылка.Дата КАК ДатаИзъятия,
	               |	СписаниеТоваровТовары.Ссылка.абс_ХозяйственнаяОперация КАК ВидКонтроля,
	               |	СписаниеТоваровТовары.Ссылка.Ответственный КАК Исполнитель
	               |ИЗ
	               |	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	               |ГДЕ
	               |	СписаниеТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И СписаниеТоваровТовары.Ссылка.Проведен = ИСТИНА
	               |	И СписаниеТоваровТовары.Ссылка.абс_ХозяйственнаяОперация = &ХозОперация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИзъятия";
				   
				   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("ХозОперация", Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000023"));
	
	ЗапросТовары = Запрос.Выполнить().Выбрать();
	
	ОбластьСтрокаТабЧасти = Макет.ПолучитьОбласть("СтрокаТЧ");	
	НомерСтроки = 0;
	
	Пока ЗапросТовары.Следующий() Цикл
		
		ВыводимыеОбласти = Новый Массив;                 	    		
		ВыводимыеОбласти.Добавить(ОбластьЗаголовокТаблицы); 
		
		НомерСтроки = НомерСтроки + 1;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТабЧасти.Параметры, ЗапросТовары);
		
		ОбластьСтрокаТабЧасти.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрокаТабЧасти.Параметры.Исполнитель = Объект.ОтвественныйОКК;
		
		ВывестиЗаголовок = Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ВыводимыеОбласти); 
		Если ВывестиЗаголовок Тогда 
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			ТабДокумент.Вывести(ОбластьЗаголовокТаблицы); 
			ВыводимыеОбласти = Новый Массив; 
		КонецЕсли;  
		
		ТабДокумент.Вывести(ОбластьСтрокаТабЧасти);
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОбластьПодвал);

	ТабДокумент.Показать();
	
КонецПроцедуры
